app/views/potins/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
	<%= link_to "Hey, c'est quoi ce potin?", potin_path(potin.id), class:"btn btn-primary" %>
	<div class="card-header"><%= potin.user.first_name %><br/></div>