app/views/potins/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---

<h3>Auteur = <%= @potins.user.first_name%></h3>