app/views/index/home.html.erb

	<%= link_to "Coucou, tu veux voir ma bite", potins_path(potin.id), class:"btn btn-primary" %>
        <div class="card-header"><%= potin.user.first_name %><br/></div>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]