app/controllers/city_controller.rb

	def show
		@city = City.find(params[:id])

  #   # Je récupère les users_id liés à la ville en params[:id]
  #   @array_of_gossips = []
  #   user_ids = User.where(city_id:params[:id]).ids
  #   # print user_ids

  #   # Je récupère les gossips liés aux users de la ville
  #   $potins_ids = []
  #   user_ids.each do |id|
  #   	$potins_ids << Potin.where(user_id:id).ids
  #   end
  #   print $potins_ids

  #   # J'aplatie
  #   $potins_ids = $gossips_ids.flatten

  #   $potins_ids.each do |gossip_id|
  #   	@array_of_gossips << Potin.find(potins_ids)
  #   end
  #   print @array_of_gossips
  # end

  # Je récupère les users_id liés à la ville en params[:id]
    @array_of_gossips = []
    user_ids = User.where(city_id:params[:id]).ids
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1  [["city_id", 3]]

    # Je récupère les gossips liés aux users de la ville
    $gossips_ids = []
    user_ids.each do |id|
      $gossips_ids << Potin.where(user_id:id).ids
---
SELECT "potins"."id" FROM "potins" WHERE "potins"."user_id" = $1  [["user_id", 5]]

    $gossips_ids = $gossips_ids.flatten

    $gossips_ids.each do |gossip_id|
      @array_of_gossips << Potin.find(gossip_id)
---
SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]