app/controllers/city_controller.rb

	def show
		@city = City.find(params[:id])
  # Je récupère les users_id liés à la ville en params[:id]
    @array_of_gossips = []
    user_ids = User.where(city_id:params[:id]).ids
    # print user_ids

    # Je récupère les gossips liés aux users de la ville
    $gossips_ids = []
    user_ids.each do |id|
      $gossips_ids << Potin.where(user_id:id).ids
---
SELECT "users"."id" FROM "users" WHERE "users"."city_id" = $1  [["city_id", 3]]
SELECT "potins"."id" FROM "potins" WHERE "potins"."user_id" = $1  [["user_id", 5]]