app/controllers/comments_controller.rb

	def create
		@comment = Comment.new(user: User.all.sample, content:params[:Comment_text], commenteable: Potin.find(params[:potin_id]))
---
SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]