app/controllers/comments_controller.rb

SELECT  "comments".* FROM "comments" ORDER BY "comments"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def show
		@comments = Comment.all

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def create
		u = User.last

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def edit
		@comments = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "content" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["content", "Belle organ monsieur au micro"], ["updated_at", "2019-02-09 14:28:32.170120"], ["id", 1]]
---
  def update
  	@comments = Comment.find(params[:id])
  	post_params = params.require(:comment).permit(:content)
  	@comments.update(post_params)