app/controllers/index_controller.rb

SELECT "potins".* FROM "potins"
---
  def home
  	@potin = Potin.all