app/controllers/potins_controller.rb

SELECT "potins".* FROM "potins"
---
  def index
    @potins = Potin.all

SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @potins = Potin.find(params[:id])

SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 1]]
INSERT INTO "potins" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    u = User.last
    @potin = Potin.new(title: params[:title], content: params[:content], user: u)

    if @potin.save

SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def edit
    @potin = Potin.find(params[:id])

SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "potins" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "potins"."id" = $4
---
  def update
    @potin = Potin.find(params[:id])
    post_params = params.require(:potin).permit(:title, :content)
    @potin.update(post_params)

SELECT  "potins".* FROM "potins" WHERE "potins"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "potins" WHERE "potins"."id" = $1  [["id", 3]]
---
    def destroy
      @potins = Potin.find(params[:id])
      @potins.destroy